starter-kit-helm.org
# -*- coding: utf-8 -*-
# -*- find-file-hook: org-babel-execute-buffer -*-

#+TITLE: Helm Customizations
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args :tangle yes

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

It controls helm and projectile.

* First, make sure that =ido-everywhere= is disabled

See https://github.com/emacs-helm/helm/issues/2085

#+BEGIN_SRC emacs-lisp :tangle no
;;(cl-assert (null ido-everywhere)
;;             nil "ido-everywhere is incompatible with helm, please disable it")
#+END_SRC

* Starting out the helm magic

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package helm
  :ensure t
  :diminish helm-mode
  :init 
  (helm-mode 1)
  (require 'helm-config))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23919 38098 19408 580000) :init (23919 38098 19349 603000) :config (23919 38098 18601 135000) :config-secs (0 0 55 163000) :init-secs (0 0 1789 715000) :use-package-secs (0 0 2041 493000)))

** Limit candidates for speed

- Limit max number of matches displayed for speed. In Pragmatic Emacs's =helm-for-files= and in Sacha Chua's dotfiles.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq helm-candidate-number-limit 100)
#+END_SRC

#+RESULTS:
: 100

* Sacha Chua

#+BEGIN_SRC emacs-lisp :tangle yes
    ;; From https://gist.github.com/antifuchs/9238468
    (setq helm-idle-delay 0.0 ; update fast sources immediately (doesn't).
          helm-input-idle-delay 0.01  ; this actually updates things
                                        ; reeeelatively quickly.
          helm-yas-display-key-on-candidate t
          helm-quick-update t
          helm-M-x-requires-pattern nil
          helm-ff-skip-boring-files t)
#+END_SRC

#+RESULTS:
: t

* Daniel Mai's stuff 

From: https://github.com/danielmai/.emacs.d/blob/master/config.org

** =helm-swoop=
From https://wikemacs.org/wiki/Helm-swoop

helm-swoop, based on Helm, allows to show interactively lines that match a pattern in another (helm) buffer. It updates while we type, and usually starts with the word at point. When we navigate around this helm list, the cursor in the original buffer jumps to the corresponding line, without loosing the helm session.

Conclusion: it's like a helm-occur bound to =s-;=

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package helm-swoop
  :ensure t
  :after helm-mode
  ;; :bind ("<s-backspace>" . helm-swoop)
  )
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23547 50524 462788 646000) :init (23547 50524 462634 659000) :config (23547 50524 462593 680000) :config-secs (0 0 10 173000) :init-secs (0 0 75 23000) :use-package-secs (0 0 317 531000)))

* Key bindings 

The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
Changed to "C-c h". Note: We must set "C-c h" globally, because we
cannot change `helm-command-prefix-key' once `helm-config' is loaded.

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "C-c h") 'helm-command-prefix)
(global-unset-key (kbd "C-x c"))

    ;; Make M-x be equal to M-x helm-M-x
(global-set-key (kbd "M-x") 'helm-M-x)

(setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x

    ;; Command: helm-show-kill-ring
(global-set-key (kbd "M-y") 'helm-show-kill-ring)

    ;; Command: helm-mini
(global-set-key (kbd "C-x b") 'helm-mini)
#+END_SRC

#+RESULTS:
: helm-mini

* Fuzzy matching for searches
To enable fuzzy matching, add the following settings:

On semantic, read https://tuhdo.github.io/helm-intro.html: Semantic is a package that provides language-aware editing commands based on 'source-code parsers'. When enabled, each file you visit is automatically parsed. Semantic provides execellent support for C/C++. To enable Semantic mode, execute =(semantic-mode 1)= (done in =starter-kit-completion.org=).

Helm offers an interface to both Semantic and Imenu at the same time: If `semantic-mode' is active in the current buffer, then use semantic for generating tags, otherwise fall back to imenu. If point is on a symbol, helm feeds the symbol into input prompt by default.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq helm-buffers-fuzzy-matching t
      helm-recentf-fuzzy-match    t)

;; Command: helm-find-files
;; helm-find-files is file navigation on steroids:
(global-set-key (kbd "C-x C-f") 'helm-find-files)
;;(global-set-key (kbd "<s-escape>") 'helm-recentf)

;; Command: helm-semantic-or-imenu
;; recall I have ==(semantic-mode 1)= in =starter-kit-completion.org=
(setq helm-semantic-fuzzy-match t
      helm-imenu-fuzzy-match    t)

(global-set-key (kbd "M-i") 'helm-semantic-or-imenu)

;; Command: helm-locate
(setq helm-locate-fuzzy-match t)

;; From ambrevar: Fallback on 'find' if 'locate' is not available.
(unless (executable-find "locate")
  (setq helm-locate-recursive-dirs-command "find %s -type d -regex .*%s.*$"))

;; See https://github.com/emacs-helm/helm/issues/1962.
;; DGM comments it out on 4 sept 2019 as I don't use it
;; (defun ambrevar/helm-locate-meta (&optional update)
;;   "Like `helm-locate' but also use the databases found in /media and /run/media.
;; With prefix argument, UPDATE the databases with custom uptions thanks to the
;; 'updatedb-local' script."
;;   (interactive "P")
;;   (let ((user-db (expand-file-name "~/.cache/locate.db"))
;;         (media-dbs (apply 'append
;;                           (mapcar
;;                            (lambda (root) (ignore-errors (file-expand-wildcards (concat root "/*/locate.db"))))
;;                            (list (concat "/run/media/" (user-login-name))
;;                                  (concat "/media/" (user-login-name))
;;                                  "/media")))))
;;     (when update
;;       (with-temp-buffer
;;         (if (= (shell-command "updatedb-local" (current-buffer)) 0)
;;             (message "%s" (buffer-string))
;;           (error "%s" (current-buffer)))))
;;     (helm-locate-with-db
;;      (mapconcat 'identity
;;                 (cons user-db media-dbs)
;;                 ":")
;;      nil (thing-at-point 'filename))))

;; Command: helm-occur
;; search for patterns in current buffer
(global-set-key (kbd "C-c h o") 'helm-occur)
(global-set-key (kbd "s-o") 'helm-occur)

;; helm-resume: taken to dgm.org or else it didn't replace <exwm-reset>
;; (global-set-key (kbd "s-r") 'helm-resume)

;; Command: helm-lisp-completion-at-point
;; To enable fuzzy matching, add this setting:
(setq helm-lisp-fuzzy-completion t)

;; Command: helm-all-mark-rings
;; (global-set-key (kbd "<s-return>") 'helm-all-mark-rings)
;; <> compulsory for return but not for s
(global-set-key (kbd "s-<return>") 'helm-all-mark-rings)

;; Command: helm-register
(global-set-key (kbd "C-c h x") 'helm-register)
(global-set-key (kbd "s-x") 'helm-register)
#+END_SRC

#+RESULTS:
: helm-register

** COMMENT From Ambrevar: 
DGM: I'm commenting out Ambrevar's stuff on 4 sept 2019.

Do not exclude any files from 'git grep'.

#+BEGIN_SRC emacs-lisp :tangle no
(setq helm-grep-git-grep-command "git --no-pager grep -n%cH --color=always --full-name -e %p -- %f")

(defun ambrevar/helm-grep-git-or-ag (arg)
  "Run `helm-grep-do-git-grep' if possible; fallback to `helm-do-grep-ag' otherwise.
Requires `call-process-to-string' from `functions'."
  (interactive "P")
  (require 'vc)
  (require 'functions)
  (if (and (vc-find-root default-directory ".git")
           (or arg (split-string (ambrevar/call-process-to-string "git" "ls-files" "-z") "\0" t)))
      (helm-grep-do-git-grep arg)
    (helm-do-grep-ag nil)))

(defun ambrevar/helm-grep-git-all-or-ag ()
  "Run `helm-grep-do-git-grep' over all git files."
  (interactive)
  (helm-grep-do-git-grep t))
#+END_SRC

#+RESULTS:
: ambrevar/helm-grep-git-all-or-ag

** More stuff from Ambrevar
*** =helm-regexp=

Commenting out by DGM on sept 2019

#+BEGIN_SRC emacs-lisp :tangle yes
;;(global-set-key [remap query-replace-regexp] 'helm-regexp)
(global-set-key (kbd "s-\'") 'helm-regexp)
;;(unless (boundp 'completion-in-region-function)
;;  (define-key lisp-interaction-mode-map [remap completion-at-point] 'helm-lisp-completion-at-point)
;;  (define-key emacs-lisp-mode-map       [remap completion-at-point] 'helm-lisp-completion-at-point))
#+END_SRC

#+RESULTS:

And still more on grep, but they are already defined in the =exwm= shortcuts, so I take them out

#+BEGIN_SRC emacs-lisp :tangle no
(ambrevar/global-set-keys
 "C-x M-g" 'ambrevar/helm-grep-git-or-ag
 "C-x M-G" 'helm-do-grep-ag)
#+END_SRC

