starter-kit-helm.org
** And more Ambrevar's stuff

TODO: =helm-ff= should allow opening several marks externally, e.g.  sxiv for pics. See https://github.com/emacs-helm/helm/wiki/Find-Files#open-files-externally.
What about the default program?  It currently defaults to ~/.mailcap, which is not so customizable.  Would ranger's rifle be useful here?  See https://github.com/emacs-helm/helm/issues/1796.  There is the `openwith' package.

TODO: Batch-open torrent files automatically.  Add to mailcap?  Same as above, C-c C-x does not allow for opening several files at once.

TODO: helm-find in big folders sometimes leads bad results, like exact match not appearing first. Better sorting?

TODO: Implement alternating-color multiline lists. See https://github.com/emacs-helm/helm/issues/1790.

Note: =wgrep-helm= allows you to edit a helm-grep-mode buffer and apply those changes to the file buffer.

#+BEGIN_SRC emacs-lisp :tangle yes
;; (when (< emacs-major-version 26)
;;   (when (require 'linum-relative nil t)
;;     (helm-linum-relative-mode 1)))

;; (when (require 'helm-descbinds nil t)
;;    (helm-descbinds-mode))

(when (require 'wgrep-helm nil t)
  (setq wgrep-auto-save-buffer t
        wgrep-enable-key (kbd "C-c h w")))

;; From Ambrevar: wgrep-face is not so pretty. Commented out as not working
;; (set-face-attribute 'wgrep-face nil :inherit 'ediff-current-diff-C :foreground 'unspecified :background 'unspecified :box nil)

;; (when (require 'helm-ls-git nil t)
;;   ;; `helm-source-ls-git' must be defined manually.
;;   ;; See https://github.com/emacs-helm/helm-ls-git/issues/34.
;;   (setq helm-source-ls-git
;;         (and (memq 'helm-source-ls-git helm-ls-git-default-sources)
;;              (helm-make-source "Git files" 'helm-ls-git-source
;;                :fuzzy-match helm-ls-git-fuzzy-match))))
#+END_SRC

#+RESULTS:

** Generic configuration

#+BEGIN_SRC emacs-lisp :tangle yes
(setq
 helm-follow-mode-persistent t
 helm-reuse-last-window-split-state t
 helm-findutils-search-full-path t
 helm-show-completion-display-function nil
 helm-completion-mode-string ""
 helm-dwim-target 'completion
 helm-echo-input-in-header-line t
 helm-use-frame-when-more-than-two-windows nil
 ;; helm-apropos-fuzzy-match t
 ;; helm-buffers-fuzzy-matching t
 ;; helm-eshell-fuzzy-match t
 ;; helm-imenu-fuzzy-match t
 ;; helm-M-x-fuzzy-match t
 ;; helm-recentf-fuzzy-match t
 ;; Use woman instead of man.
 helm-man-or-woman-function nil
 ;; https://github.com/emacs-helm/helm/issues/1910
 helm-buffers-end-truncated-string "…"
 helm-buffer-max-length 22
 helm-window-show-buffers-function 'helm-window-mosaic-fn
 helm-window-prefer-horizontal-split t)
#+END_SRC

** Apropos 

#+BEGIN_SRC emacs-lisp :tangle yes
;; Command: helm-apropos
;; To enable fuzzy matching, add this setting:
(setq helm-apropos-fuzzy-match t)
;; (global-set-key [remap apropos-command] 'helm-apropos) ;; dgm comments out on sept 2019
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
;;; Add bindings to `helm-apropos`. TODO: Does not work most of the times.
;;; https://github.com/emacs-helm/helm/issues/1140
;;; Commented out by DGM on 4 sept 2019
;; (defun ambrevar/helm-def-source--emacs-commands (&optional default)
;;   (helm-build-in-buffer-source "Commands"
;;     :init `(lambda ()
;;              (helm-apropos-init 'commandp ,default))
;;     :fuzzy-match helm-apropos-fuzzy-match
;;     :filtered-candidate-transformer (and (null helm-apropos-fuzzy-match)
;;                                          'helm-apropos-default-sort-fn)
;;     :candidate-transformer 'helm-M-x-transformer-1
;;     :nomark t
;;     :action '(("Describe Function" . helm-describe-function)
;;               ("Find Function" . helm-find-function)
;;               ("Info lookup" . helm-info-lookup-symbol))))

(global-set-key (kbd "s-a") 'helm-apropos)
#+END_SRC

#+RESULTS:
: helm-apropos

** COMMENT The =M-s= prefix
Use the =M-s= prefix just like `occur'. 
Note that the =s= in the prefix is the letter =s= and not the =super= key.
Note that I think =M-i= does the same.

DGM, 16 july: I disable this as the prefix =M-s= is not working. Don't know why. 


#+BEGIN_SRC emacs-lisp :tangle no
(define-key prog-mode-map (kbd "M-s f") 'helm-semantic-or-imenu)
;;; The text-mode-map binding targets structured text modes like Markdown.
(define-key text-mode-map (kbd "M-s f") 'helm-semantic-or-imenu)
(with-eval-after-load 'org
  (require 'helm-org-contacts nil t)
  (define-key org-mode-map (kbd "M-s f") 'helm-org-in-buffer-headings))
(with-eval-after-load 'woman
  (define-key woman-mode-map (kbd "M-s f") 'helm-imenu))
(with-eval-after-load 'man
  (define-key Man-mode-map (kbd "M-s f") 'helm-imenu))
#+END_SRC

#+RESULTS:

** COMMENT More stuff!!!

Commented out by DGM on 4 sept 2019

#+BEGIN_SRC emacs-lisp :tangle no
(setq helm-source-names-using-follow '("Occur" "Git-Grep" "AG" "mark-ring" "Org Headings" "Imenu"))

;;; From https://www.reddit.com/r/emacs/comments/5q922h/removing_dot_files_in_helmfindfiles_menu/.
(defun ambrevar/helm-skip-dots (old-func &rest args)
  "Skip . and .. initially in helm-find-files.  First call OLD-FUNC with ARGS."
  (apply old-func args)
  (let ((sel (helm-get-selection)))
    (if (and (stringp sel) (string-match "/\\.$" sel))
        (helm-next-line 2)))
  (let ((sel (helm-get-selection))) ; if we reached .. move back
    (if (and (stringp sel) (string-match "/\\.\\.$" sel))
        (helm-previous-line 1))))

(advice-add #'helm-preselect :around #'ambrevar/helm-skip-dots)
(advice-add #'helm-ff-move-to-first-real-candidate :around #'ambrevar/helm-skip-dots)

(with-eval-after-load 'desktop
  (add-to-list 'desktop-globals-to-save 'kmacro-ring)
  (add-to-list 'desktop-globals-to-save 'last-kbd-macro)
  (add-to-list 'desktop-globals-to-save 'kmacro-counter)
  (add-to-list 'desktop-globals-to-save 'kmacro-counter-format)
  (add-to-list 'desktop-globals-to-save 'helm-ff-history)
  (add-to-list 'desktop-globals-to-save 'comint-input-ring))
;;; Column indices might need some customizing. See `helm-top-command' and
;;; https://github.com/emacs-helm/helm/issues/1586 and
;;; https://github.com/emacs-helm/helm/issues/1909.
#+END_SRC

** =top=

#+begin_src emacs-lisp :tangle yes
(helm-top-poll-mode)
(global-set-key (kbd "s-t") 'helm-top)
#+end_src

#+RESULTS:
: helm-top

** COMMENT Convenience

Commented out by DGM on 4 sept 2019
#+BEGIN_SRC emacs-lisp :tangle no
;;; Convenience.
(defun ambrevar/helm-toggle-visible-mark-backwards (arg)
  (interactive "p")
  (helm-toggle-visible-mark (- arg)))
;; (define-key helm-map (kbd "S-SPC") 'ambrevar/helm-toggle-visible-mark-backwards)

;; (global-set-key  (kbd "C-<f4>") 'helm-execute-kmacro)
#+END_SRC


* Google 

#+BEGIN_SRC emacs-lisp :tangle yes
;; helm-google-suggest
(global-set-key (kbd "C-c h g") 'helm-google-suggest)
#+END_SRC

* Eldoc 

ELDOC is interactive eLisp evaluation.

In Sacha's dotfiles, she says: "Eldoc provides minibuffer hints when working with Emacs Lisp."

#+BEGIN_SRC emacs-lisp :tangle yes
;; helm-eval-expression-with-eldoc
;; (global-set-key (kbd "C-c h M-:") 'helm-eval-expression-with-eldoc)
(global-set-key (kbd "s-\(") 'helm-eval-expression-with-eldoc)
#+END_SRC

#+RESULTS:
: helm-eval-expression-with-eldoc

* Eshell

Por alguna razon el keybind no se registra, asi que lo quito.

#+BEGIN_SRC emacs-lisp :tangle yes
;; Command: helm-eshell-history
(require 'helm-eshell)

;; (add-hook 'eshell-mode-hook
;;          '(lambda ()
;;             (define-key eshell-mode-map (kbd "C-c h C-c h")  'helm-eshell-history))) 
#+END_SRC

#+RESULTS:
| (lambda nil (define-key eshell-mode-map  'eshell-bol)) | helm-gtags-mode | ambrevar/helm/eshell-set-keys | (lambda nil (define-key eshell-mode-map (kbd C-c h C-c h) 'helm-eshell-history)) | tramp-eshell-directory-change | ess-r-package-activate-directory-tracker |

** Ambrevar's eshell

#+BEGIN_SRC emacs-lisp :tangle yes
;;; Eshell
(defun ambrevar/helm/eshell-set-keys ()
  (define-key eshell-mode-map [remap eshell-pcomplete] 'helm-esh-pcomplete)
  (define-key eshell-mode-map (kbd "M-p") 'helm-eshell-history))
  ;; dgm comments out on 4 sept 2019
  ;;(define-key eshell-mode-map (kbd "M-s") nil) ; Useless when we have 'helm-eshell-history.
  ;;(define-key eshell-mode-map (kbd "M-s f") 'helm-eshell-prompts-all)) ;; this one doesn't work... I don't know what it'd do.
(add-hook 'eshell-mode-hook 'ambrevar/helm/eshell-set-keys)
#+END_SRC

#+RESULTS:
| (lambda nil (define-key eshell-mode-map  'eshell-bol)) | helm-gtags-mode | ambrevar/helm/eshell-set-keys | tramp-eshell-directory-change | ess-r-package-activate-directory-tracker |

* Comint 

Disabled as it gives rise to lisp error

#+BEGIN_SRC emacs-lisp :tangle no
;; Command: helm-comint-input-ring
;; (define-key shell-mode-map (kbd "C-c h C-c h") 'helm-comint-input-ring)
#+END_SRC

#+RESULTS:

* Mini-buffer history 

If you get into the minibuffer (=C-x b= for =helm-mini=), then you get its history with =C-c C-l=.

#+BEGIN_SRC emacs-lisp :tangle yes
;; Command: helm-mini-buffer-history
(define-key minibuffer-local-map (kbd "C-c C-l") 'helm-minibuffer-history)
#+END_SRC

#+RESULTS:
: helm-minibuffer-history

* helm-descbinds

List active key bindings:

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package helm-descbinds
	:ensure t)
(helm-descbinds-mode)
#+END_SRC

#+RESULTS:
: t

