starter-kit-helm.org
* Helm and gtags

Further customization of =gtags= with =helm=, from http://tuhdo.github.io/c-ide.html.

Check out: http://tuhdo.github.io/c-ide.html and https://github.com/syohex/emacs-helm-gtags

Also of interest this setup: https://github.com/tuhdo/emacs-c-ide-demo/blob/master/custom/setup-helm-gtags.el
and https://github.com/yusekiya/dotfiles/blob/master/.emacs.d/config/packages/my-helm-config.el

** TODO Understand how =gtags= differ from =etags=

#+begin_src emacs-lisp :tangle yes
    ;; Tuhdo says to put this but if I do emacs spits error mesage on start up.
    ;;(require 'setup-helm)
    ;;(require 'setup-helm-gtags)

(use-package helm-gtags
	:ensure t
    :init
    ;; Enable helm-gtags-mode
    (add-hook 'dired-mode-hook 'helm-gtags-mode)
    (add-hook 'eshell-mode-hook 'helm-gtags-mode)
    (add-hook 'c-mode-hook 'helm-gtags-mode)
    (add-hook 'c++-mode-hook 'helm-gtags-mode)
    (add-hook 'asm-mode-hook 'helm-gtags-mode)
    ;; (add-hook 'python-mode-hook 'helm-gtags-mode)
    :config
    (setq
     helm-gtags-ignore-case t
     helm-gtags-auto-update t
     helm-gtags-use-input-at-cursor t
     helm-gtags-pulse-at-cursor t
     helm-gtags-prefix-key "C-c g"
     helm-gtags-suggested-key-mapping t))

    (define-key helm-gtags-mode-map (kbd "C-c g a") 'helm-gtags-tags-in-this-function)
    (define-key helm-gtags-mode-map (kbd "C-j") 'helm-gtags-select)
    (define-key helm-gtags-mode-map (kbd "M-.") 'helm-gtags-dwim)
    (define-key helm-gtags-mode-map (kbd "M-,") 'helm-gtags-pop-stack)
    (define-key helm-gtags-mode-map (kbd "C-c <") 'helm-gtags-previous-history)
    (define-key helm-gtags-mode-map (kbd "C-c >") 'helm-gtags-next-history)
#+end_src

#+RESULTS:
: helm-gtags-next-history

* Helm-bibtex
And now the bit by Ista Zahn in tip from: https://github.com/izahn/dotemacs but modified to use helm instead of ivy.
This allows you to search your BibTeX files for references to insert into the current document. For it to work you will need to set `bibtex-completion-bibliography` to the location of your BibTeX files.
Initiate a citation search with ivy-bibtex, bound to =C-c r= (not working, of course. This is the keybinding for revert buffer.)

Commented out by DGM: not sure it is working and I can use ivy with helm

From https://github.com/tmalsburg/helm-bibtex: Helm-bibtex and ivy-bibtex allow you to search and manage your BibTeX bibliography. They both share the same generic backend, bibtex-completion, but one uses the Helm completion framework and the other Ivy as a front-end.

#+begin_src emacs-lisp :tangle yes
;; (setq ivy-bibtex-default-action 'bibtex-completion-insert-citation)
(use-package helm-bibtex
  :ensure t)
;; (global-set-key (kbd "<s-backspace>") 'helm-bibtex) ;; not needed. Already in =C-c ]=. <s-backspace> relocated to helm-swoop. Aunque ojo que en Olivetti mode =C-c ]= esta' bound to another thing.
#+end_src

#+RESULTS:
: helm-bibtex

Tip from =titus= for =helm-bibtex=: I use the menu key as the prefix key for all helm commands and bind helm-bibtex to b. Helm-bibtex can then be started using <menu> b. It is also useful to bind helm-resume to <menu> in helm-command-map. With this binding, <menu> <menu> can be used to reopen the last helm search.

** Bibtex-completion

Bibtex-completion depends on helm-bibtex. That's why I paste it here. A minimal configuration involves telling =bibtex-completion= where your bibliographies can be found. I am leaving it as not a list.

#+BEGIN_EXAMPLE
(setq bibtex-completion-bibliography 
      '("/media/dgm/blue/documents/bibs/socbib.bib"))  
#+END_EXAMPLE

#+BEGIN_SRC emacs-lisp :tangle yes
(setq bibtex-completion-bibliography "/media/dgm/blue/documents/bibs/socbib.bib")
#+END_SRC

#+RESULTS:
: /media/dgm/blue/documents/bibs/socbib.bib

Specify where PDFs can be found: =Bibtex-completion= assumes that the name of a PDF consists of the BibTeX key followed plus a user-defined suffix (.pdf by default). For example, if a BibTeX entry has the key Darwin1859, bibtex-completion searches for Darwin1859.pdf.

I am commenting out as I have the variable =helm-bibtex-library-path= in =starter-kit-helm.org=

#+BEGIN_SRC emacs-lisp :tangle yes
(setq bibtex-completion-library-path '("/media/dgm/blue/documents/elibrary/org/references/pdfs"))
#+END_SRC

#+RESULTS:
| /media/dgm/blue/documents/elibrary/org/references/pdfs/ |


Bibtex-completion supports two methods for storing notes. It can either store all notes in one file or store notes in multiple files, one file per publication. In the first case, the customization variable bibtex-completion-notes-path has to be set to the full path of the notes file:
I am commenting it out as I have the variable =helm-bibtex-notes-path= in =starter-kit-helm.org=

#+BEGIN_SRC emacs-lisp :tangle yes
(setq bibtex-completion-notes-path "/media/dgm/blue/documents/elibrary/org/references")
#+END_SRC

#+RESULTS:
: /media/dgm/blue/documents/elibrary/org/references/readings.org

(See also Kitchin on setting these paths here https://github.com/jkitchin/org-ref.)

Symbols used for indicating the availability of notes and PDF files

#+BEGIN_SRC emacs-lisp :tangle yes
(setq bibtex-completion-pdf-symbol "⌘")
(setq bibtex-completion-notes-symbol "✎")
#+END_SRC

#+RESULTS:
: ✎

Open pdf with system pdf viewer

#+BEGIN_SRC emacs-lisp :tangle yes
(setq bibtex-completion-pdf-open-function 'org-open-file)
#+END_SRC

#+RESULTS:
: org-open-file

** The Reddit workflow

From: https://www.reddit.com/r/emacs/comments/4gudyw/help_me_with_my_orgmode_workflow_for_notetaking/

With this setup helm-bibtex points to the same notes file as =org-ref=. Just run =M-x helm-bibtex= (=C-]=) and select the article you want. Instead of pressing =<return>=, press =<tab>=. This opens up helm's alternate action list where you can choose to =Edit notes=. This opens up the exact notes file created by org-ref.

#+BEGIN_SRC emacs-lisp :tangle yes
 (setq helm-bibtex-bibliography "/media/dgm/blue/documents/bibs/socbib.bib" 
       helm-bibtex-library-path "/media/dgm/blue/documents/elibrary/org/references/pdfs/"
       helm-bibtex-notes-path "/media/dgm/blue/documents/elibrary/org/references/readings.org")
#+END_SRC

#+RESULTS:
: /media/dgm/blue/documents/elibrary/org/references/readings.org


* Uncle Dave

Lines from uncle dave at https://github.com/daedreth/UncleDavesEmacs and Tuhdo  https://tuhdo.github.io/helm-intro.html

#+BEGIN_SRC emacs-lisp :tangle yes
(define-key helm-find-files-map (kbd "C-b") 'helm-find-files-up-one-level)
;; (define-key helm-find-files-map (kbd "C-f") 'helm-execute-persistent-action)
(define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action but this gives rise to problems. See https://github.com/jkitchin/org-ref/issues/527
(define-key helm-map (kbd "C-i")   'helm-execute-persistent-action) ; make TAB work in terminal
(define-key helm-map (kbd "C-z")  'helm-select-action) ; list actions using C-z... direct from Tuhdo! 
#+END_SRC

#+RESULTS:
: helm-select-action

* Projectile 

I kept loosing my projects in external drives upon re-start. My attempt to keep them thru magit is copied from https://emacs.stackexchange.com/questions/32634/how-can-the-list-of-projects-used-by-projectile-be-manually-updated/32635

#+srcname: projectile
#+BEGIN_SRC emacs-lisp :tangle yes
;; Projectile
(use-package projectile
  :ensure t
  :config 
  (projectile-global-mode t)
  (setq projectile-project-search-path '("~/.emacs.d/"
                                         "~/texmf/"
                                         "~/Dropbox/gtd/"
                                         "/media/dgm/blue/documents/proyectos/mtj/"
                                         "/media/dgm/blue/documents/dropbox/"
                                         "/media/dgm/blue/documents/UNED/"
                                         "/media/dgm/blue/documents/data/eurostat" 
                                         "/media/dgm/blue/documents/programming"
                                         "/media/dgm/blue/documents/My-Academic-Stuff"
                                         "/media/dgm/blue/documents/personal"
                                         "/home/dgm/Dropbox/gtd"
                                         "/media/dgm/blue/documents/bibs"
                                         "/media/dgm/blue/documents/templates"
                                         "/media/dgm/blue/documents/proyectos/alianza"
                                         "/media/dgm/blue/documents/cv"
                                         "/media/dgm/blue/documents/backups"
                                         "/media/dgm/blue/documents/UNED/teaching/mis-cursos"
                                         "/media/dgm/blue/documents/elibrary/women-labor-market"))

  (projectile-add-known-project "~/.emacs.d/")
  (projectile-add-known-project  "~/texmf/")
  (projectile-add-known-project "~/Dropbox/gtd/")
  (projectile-add-known-project "/media/dgm/blue/documents/proyectos/mtj/")
  (projectile-add-known-project "/media/dgm/blue/documents/dropbox/")
  (projectile-add-known-project "/media/dgm/blue/documents/UNED/")
  (projectile-add-known-project "/media/dgm/blue/documents/data/eurostat")
  (projectile-add-known-project "/media/dgm/blue/documents/programming")
  (projectile-add-known-project "/media/dgm/blue/documents/My-Academic-Stuff")
  (projectile-add-known-project "/media/dgm/blue/documents/personal")  
  (projectile-add-known-project "/home/dgm/Dropbox/gtd")  
  (projectile-add-known-project "/media/dgm/blue/documents/bibs")  
  (projectile-add-known-project "/media/dgm/blue/documents/templates")
  (projectile-add-known-project "/media/dgm/blue/documents/proyectos/alianza/")
  (projectile-add-known-project "/media/dgm/blue/documents/cv/")
  (projectile-add-known-project "/media/dgm/blue/documents/backups")
  (projectile-add-known-project "/media/dgm/blue/documents/UNED/teaching/mis-cursos/")
  (projectile-add-known-project "/media/dgm/blue/documents/elibrary/women-labor-market/")
  
  (when (require 'magit nil t)
    (mapc #'projectile-add-known-project
          (mapcar #'file-name-as-directory (magit-list-repos)))
    ;; Optionally write to persistent `projectile-known-projects-file'
    (projectile-save-known-projects)))

;; from: https://github.com/bbatsov/projectile#usage
(projectile-mode +1) ;; You now need to explicitly enable projectile and set a prefix. See      https://stackoverflow.com/questions/31421106/why-emacs-project-c-c-p-is-undefined, I guess it's already done with (projectile-global-mode t) in the use-package settings... but just in case.
;;(define-key projectile-mode-map (kbd "s--") 'projectile-command-map)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)

(setq projectile-enable-caching nil) ;; update 22 nov 2018. In C-h v projectile-indexing-method they recommend to have it set to alien to have this other variable set to true. If it does not work, revert to instructions in emacs's cheatsheet.
;; (setq projectile-enable-caching nil) ; see https://emacs.stackexchange.com/questions/2164/projectile-does-not-show-all-files-in-project
;; https://github.com/bbatsov/projectile/issues/1183
;; trying to fix slow behaviour of emacs
(setq projectile-mode-line
      '(:eval (format " Projectile[%s]"
                      (projectile-project-name))))

#+END_SRC

