starter-kit-helm.org
** Helm-Projectile

#+srcname: helm-projectile
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package helm-projectile
  :ensure t
  :after helm-mode 
  :init     
  (setq projectile-completion-system 'helm)
  :commands helm-projectile
  ;;   :bind ("C-c p h" . helm-projectile)
  )

(helm-projectile-on)   ;;; creo que no hace falta tras decir =ensure t= in use-package.
;; (define-key projectile-mode-map [?\s-u] 'helm-projectile-find-file-in-known-projects) 
(setq projectile-switch-project-action 'helm-projectile)
(global-set-key (kbd "s-h") 'helm-projectile)
;; from https://projectile.readthedocs.io/en/latest/usage/
;; You can go one step further and set a list of folders which Projectile is automatically going to check for projects. But in reality, if I re-start the computer, Projectile does not recall this list. 
#+END_SRC

#+RESULTS: helm-projectile
: helm-projectile

#+RESULTS: projectile
: helm-projectile-switch-to-buffer

Need to use =helm-projectile-find-other-file=. See https://tuhdo.github.io/helm-projectile.html

#+BEGIN_SRC emacs-lisp :tangle yes
(setq projectile-other-file-alist '(("cpp" "h" "hpp" "ipp")
                                    ("ipp" "h" "hpp" "cpp")
                                    ("hpp" "h" "ipp" "cpp")
                                    ("cxx" "hxx" "ixx")
                                    ("ixx" "cxx" "hxx")
                                    ("hxx" "ixx" "cxx")
                                    ("c" "h")
                                    ("m" "h")
                                    ("mm" "h")
                                    ("h" "c" "cpp" "ipp" "hpp" "m" "mm")
                                    ("cc" "hh")
                                    ("hh" "cc")
                                    ("vert" "frag")
                                    ("frag" "vert")
                                    (nil "lock" "gpg")
                                    ("lock" "")
                                    ("gpg" "")))

(add-to-list 'projectile-other-file-alist '("org" "el")) ;; switch from org -> el 
(add-to-list 'projectile-other-file-alist '("el" "org")) ;; switch from el -> org 
(add-to-list 'projectile-other-file-alist '("Rnw" "R"))
(add-to-list 'projectile-other-file-alist '("R" "Rnw"))
(add-to-list 'projectile-other-file-alist '("Rnw" "tex"))
(add-to-list 'projectile-other-file-alist '("tex" "Rnw"))
(add-to-list 'projectile-other-file-alist '("org" "tex"))
(add-to-list 'projectile-other-file-alist '("tex" "org"))
(add-to-list 'projectile-other-file-alist '("tex" "log"))
(add-to-list 'projectile-other-file-alist '("log" "tex"))
(add-to-list 'projectile-other-file-alist '("org" "html"))
(add-to-list 'projectile-other-file-alist '("html" "org"))
#+END_SRC

#+RESULTS:
| html | org  |     |     |     |   |    |
| org  | html |     |     |     |   |    |
| log  | tex  |     |     |     |   |    |
| tex  | log  |     |     |     |   |    |
| tex  | org  |     |     |     |   |    |
| org  | tex  |     |     |     |   |    |
| tex  | Rnw  |     |     |     |   |    |
| Rnw  | tex  |     |     |     |   |    |
| R    | Rnw  |     |     |     |   |    |
| Rnw  | R    |     |     |     |   |    |
| el   | org  |     |     |     |   |    |
| org  | el   |     |     |     |   |    |
| cpp  | h    | hpp | ipp |     |   |    |
| ipp  | h    | hpp | cpp |     |   |    |
| hpp  | h    | ipp | cpp |     |   |    |
| cxx  | hxx  | ixx |     |     |   |    |
| ixx  | cxx  | hxx |     |     |   |    |
| hxx  | ixx  | cxx |     |     |   |    |
| c    | h    |     |     |     |   |    |
| m    | h    |     |     |     |   |    |
| mm   | h    |     |     |     |   |    |
| h    | c    | cpp | ipp | hpp | m | mm |
| cc   | hh   |     |     |     |   |    |
| hh   | cc   |     |     |     |   |    |
| vert | frag |     |     |     |   |    |
| frag | vert |     |     |     |   |    |
| nil  | lock | gpg |     |     |   |    |
| lock |      |     |     |     |   |    |
| gpg  |      |     |     |     |   |    |

** Advice from Tuhdo for ignoring files

From https://github.com/bbatsov/projectile/issues/184

#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'projectile-globally-ignored-files "*.png")
(setq projectile-globally-ignored-file-suffixes '(".cache"))
#+END_SRC

#+RESULTS:
| .cache |

** Various =helm-projectile= shortcuts

#+begin_src emacs-lisp :tangle yes
;; (define-key projectile-mode-map [?\s-d] 'projectile-switch-project)
(define-key projectile-mode-map [?\s-\$] 'helm-projectile-find-file-dwim)
(define-key projectile-mode-map [?\s-\`] 'helm-projectile-find-other-file)
(define-key projectile-mode-map [?\s-\;] 'helm-projectile-find-dir)
(define-key projectile-mode-map [?\s-j] 'helm-projectile-find-file)
(define-key projectile-mode-map [?\s-l] 'helm-projectile-switch-to-buffer)
;;(define-key projectile-mode-map [?\s-y] 'projectile-ag) ;; this is not working. 
#+end_src

#+RESULTS:
: helm-projectile-switch-to-buffer
* helm-man-woman

With helm-man-woman, you can quickly jump to any man entry using the Helm interface, either by typing in Helm prompt or if the point is on a symbol, opening the man page at point. To enable man page at point, add the following code: 

#+begin_src emacs-lisp :tangle yes
(add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)
(global-set-key (kbd "s-m") 'helm-man-woman)
#+end_src

#+RESULTS:
| helm-source-imenu | helm-source-imenu-all | helm-source-info-elisp | helm-source-etags-select | helm-source-man-pages | helm-source-occur | helm-source-moccur | helm-source-grep-ag | helm-source-grep-git | helm-source-grep |

* Grep, Ack, AG
** COMMENT =helm-ack=

=C-x C-f= you start a =helm-find-files= session. There you can do =C-s= to recursively grep a selected directory.  Every time you type a character, helm updates grep result immediately. You can use ack-grep to replace grep with this configuration:

DGM, 4 sept 2019: not sure ack is better than grep.

#+begin_src emacs-lisp :tangle no
(use-package helm-ack)

(when (executable-find "ack-grep")
  (setq helm-grep-default-command "ack-grep -Hn --no-group --no-color %e %p %f"
        helm-grep-default-recurse-command "ack-grep -H --no-group --no-color %e %p %f"))
#+end_src

#+RESULTS:

** Grep in Projectile project

#+begin_src emacs-lisp :tangle yes
 (global-set-key (kbd "s-g") 'helm-projectile-grep)
 ;; (global-set-key (kbd "s-f") 'helm-projectile-ag)

#+end_src

#+RESULTS:
: helm-projectile-grep

* =helm-ag=:  Interface with Ag ("The Silver Searcher")

The Silver Searcher is grep-like program implemented by =C=. An attempt to make something better than =ack-grep=.

It searches pattern about 3–5x faster than ack-grep. It ignores file patterns from your .gitignore and .hgignore. 

[[https://github.com/ggreer/the_silver_searcher][The Silver Searcher]] is a very fast, smart code search tool, similar to
ack. Install it via homebrew. The emacs interface, `ag-mode`, is [[https://github.com/Wilfred/ag.el/#agel][described here]].

** Critical options: 

1. =-n --norecurse= Don't recurse into directories 
2. =-r --recurse= Recurse into directories when searching. Default it true.

#+BEGIN_SRC emacs-lisp :tangle yes
;; Originally in starter-kit-bindings.org like this
;;  (require 'ag)
;;  (define-key global-map "\C-x\C-a" 'ag) 
;;  (define-key global-map "\C-x\C-r" 'ag-regexp)

;; new bindings by DGM to try and use 'helm-ag
;;  (define-key global-map "\C-x\C-a" 'helm-ag) 
;;  (define-key global-map "\C-x\C-r" 'helm-ag-regexp)

(use-package ag 
  :ensure t)

(use-package helm-ag
  :ensure t
  :after (helm-mode ag)
  :bind ("s-f" . helm-projectile-ag)
  :init (setq helm-ag-base-command "/usr/bin/ag"
              helm-ag-insert-at-point t
              helm-ag-fuzzy-match     t
              helm-ag-command-option " --hidden" 
              helm-ag-use-agignore t))
#+END_SRC

#+RESULTS:
: helm-projectile-ag


* EXWM

Basic commands with for interfacing with =exwm= with =helm=

#+BEGIN_SRC emacs-lisp :tangle yes
(with-eval-after-load 'helm
  ;; Need `with-eval-after-load' here since 'helm-map is not defined in 'helm-config.
  ;;  (ambrevar/define-keys helm-map "s-\\" 'helm-toggle-resplit-and-swap-windows) ;; already used in starter-kit-exwm.org for ambrevar/toggle-window-split
  ;; (exwm-input-set-key (kbd "s-c") #'helm-resume)  ;; get the latest helm thing you did!, i.e., reopen the last helm search. Hey: if I enable this line, instead of helm-resume I get helm-occur. Why?
  ;; (exwm-input-set-key (kbd "s-b") #'helm-mini) ;; not needed as already in =C-x b=
  ;; (exwm-input-set-key (kbd "s-f") #'helm-find-files) ;; already in C-x C-f
  ;; (exwm-input-set-key (kbd "s-:") #'helm-for-files) ;; tuhdo doesn't use it, so it goes
  (exwm-input-set-key (kbd "s-D") #'helm-locate)
  (exwm-input-set-key (kbd "s-d") #'helm-find))
  ;;(when (fboundp 'ambrevar/helm-locate-meta)
  ;;  (exwm-input-set-key (kbd "!!here") #'ambrevar/helm-locate-meta))
  ;; (exwm-input-set-key (kbd "s-F") #'helm-ag)
  ;; (exwm-input-set-key (kbd "s-f") #'helm-do-grep-ag))
  ;;(exwm-input-set-key (kbd "s-g") 'ambrevar/helm-grep-git-or-ag)
  ;;(exwm-input-set-key (kbd "s-G") 'ambrevar/helm-grep-git-all-or-ag))
#+END_SRC

#+RESULTS:

** EXWM buffers with helm. Also: make =helm-mini= almighty

#+BEGIN_SRC emacs-lisp :tangle yes
(require 'helm-bookmark)

(use-package helm-exwm)
;; (when (require 'helm-exwm nil t)
(add-to-list 'helm-source-names-using-follow "EXWM buffers")
(setq helm-exwm-emacs-buffers-source (helm-exwm-build-emacs-buffers-source))
(setq helm-exwm-source (helm-exwm-build-source))
(setq helm-mini-default-sources `(helm-exwm-emacs-buffers-source
                                  helm-exwm-source
                                  helm-source-buffers-list
                                  helm-source-recentf
                                  ,(when (boundp 'helm-source-ls-git) 'helm-source-ls-git)
                                  helm-source-bookmarks
                                  helm-source-bookmark-set
                                  helm-source-buffer-not-found))

;; Not sure how this works
;;(ambrevar/define-keys helm-exwm-map
;;   "s-!" 'helm-buffer-run-kill-persistent
;;   "s-#" 'helm-buffer-switch-other-window)
;; The above does not work and I don't know what is meant to do

;; next two lines work in the context of a helm menu like the one triggered with =C-x b=
(global-set-key (kbd "C-c h w") 'helm-buffer-switch-other-window)
(global-set-key (kbd "C-c h k") 'helm-buffer-run-kill-persistent)

;; Launcher
(exwm-input-set-key (kbd "s-e") 'helm-run-external-command)

;; Web browser. Turned off by DGM on 22 august 2019
;; (exwm-input-set-key (kbd "M-s-j") #'helm-exwm-switch-browser)               ;; I don't use these two and I don't see the user case.
;; (exwm-input-set-key (kbd "s-j")   #'helm-exwm-switch-browser-other-window)  ;; not using it
#+END_SRC

#+RESULTS:

