starter-kit-helm.org
* Allowing =ido= mode

#+BEGIN_SRC emacs-lisp :tangle yes
(defun ido-recentf-open ()
  "Use `ido-completing-read' to find a recent file."
  (interactive)
  (if (find-file (ido-completing-read "Find recent file: " recentf-list))
      (message "Opening file...")
    (message "Aborting")))

(global-set-key (kbd "C-x f") 'ido-recentf-open)

(add-to-list 'helm-completing-read-handlers-alist '(ido-recentf-open  . ido))
#+END_SRC

#+RESULTS:
: ((ido-use-virtual-buffers . ido) (ido-recentf-open . ido) (recentf-open-files . ido) (describe-function . helm-completing-read-symbols) (describe-variable . helm-completing-read-symbols) (describe-symbol . helm-completing-read-symbols) (debug-on-entry . helm-completing-read-symbols) (find-function . helm-completing-read-symbols) (disassemble . helm-completing-read-symbols) (trace-function . helm-completing-read-symbols) (trace-function-foreground . helm-completing-read-symbols) (trace-function-background . helm-completing-read-symbols) (find-tag . helm-completing-read-default-find-tag) (org-capture . helm-org-completing-read-tags) (org-set-tags . helm-org-completing-read-tags) (ffap-alternate-file) (tmm-menubar) (find-file) (find-file-at-point . helm-completing-read-sync-default-handler) (ffap . helm-completing-read-sync-default-handler) (execute-extended-command) (dired-do-rename . helm-read-file-name-handler-1) (dired-do-copy . helm-read-file-name-handler-1) (dired-do-symlink . helm-read-file-name-handler-1) (dired-do-relsymlink . helm-read-file-name-handler-1) (dired-do-hardlink . helm-read-file-name-handler-1))

* Helm-pass
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package password-store)
(use-package helm-pass)
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23561 2421 145456 378000) :init (23561 2421 145411 153000) :config (23561 2421 144875 137000) :config-secs (0 0 81 645000) :init-secs (0 0 927 125000) :use-package-secs (0 0 1190 268000)))

* Quit Helm with one key stroke

Often when invoking helm and wanting to cancel, I have to press =C-g= multiple times. Trying here to reduce it to one time.

From: https://www.reddit.com/r/emacs/comments/7eboyr/closing_helmmx_with_single_key_press/

Originally i had also =(define-key helm-M-x-map (kbd "ESC") 'helm-keyboard-quit)= but then I got the message "(void-variable helm-M-x-map)" and could not use Helm.


#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'helm-after-initialize-hook
          (lambda()
            (define-key helm-buffer-map (kbd "C-g") 'helm-keyboard-quit)
            (define-key helm-map (kbd "C-g") 'helm-keyboard-quit)))
#+END_SRC

#+RESULTS:
| (lambda nil (define-key helm-buffer-map (kbd C-g) 'helm-keyboard-quit) (define-key helm-map (kbd C-g) 'helm-keyboard-quit)) | (lambda nil (define-key helm-buffer-map (kbd ESC) 'helm-keyboard-quit) (define-key helm-map (kbd ESC) 'helm-keyboard-quit)) | helm-reset-yank-point |

* =org-rifle=

See https://github.com/alphapapa/org-rifle

=org-rifle= searches in your notes as you type and it finds the search words in any order which makes it very easy and quick to find a given note.

What does my rifle do? It searches rapidly through my Org files. It searches both headings and contents of entries in Org buffers, and it displays entries that match all search terms, whether the terms appear in the heading, the contents, or both. Matching portions of entries’ contents are displayed with surrounding context and grouped by buffer to make it easy to acquire your target.'

In contrast with org-occur and similar commands, helm-org-rifle is entry-based (i.e. a heading and all of its contents, not including subheadings), while org-occur is line-based. So org-occur will show you entire lines that contain matching words, without any reference to the heading the line is under, while helm-org-rifle will show the heading of the entry that matches, followed by context around each matching word in the entry. In other words, helm-org-rifle is sort of like Google, while org-occur is sort of like grep.

Entries are fontified by default to match the appearance of an Org buffer, and optionally the entire path can be displayed for each entry, rather than just its own heading.

** Usage

Run one of the rifle commands, type some words, and results will be displayed, grouped by buffer. Hit RET to show the selected entry, or <C-return> to show it in an indirect buffer.

*** Helm commands: show results in a Helm buffer

- helm-org-rifle: Show results from all open Org buffers
- helm-org-rifle-agenda-files: Show results from Org agenda files
- helm-org-rifle-current-buffer: Show results from current buffer
- helm-org-rifle-directories: Show results from selected directories; with prefix, recursively
- helm-org-rifle-files: Show results from selected files
- helm-org-rifle-org-directory: Show results from Org files in org-directory

*** Occur commands: show results in an occur-like, persistent buffer

- helm-org-rifle-occur: Show results from all open Org buffers
- helm-org-rifle-occur-agenda-files: Show results from Org agenda files
- helm-org-rifle-occur-current-buffer: Show results from current buffer
- helm-org-rifle-occur-directories: Show results from selected directories; with prefix, recursively
- helm-org-rifle-occur-files: Show results from selected files
- helm-org-rifle-occur-org-directory: Show results from Org files in org-directory

*** Tips
- Select multiple entries in the Helm buffer to display selected entries in a read-only, occur-style buffer.
- Save all results in a Helm buffer to a helm-org-rifle-occur buffer by pressing C-s (like helm-grep-save-results).
- Show results from certain buffers by typing the name of the buffer (usually the filename).
- Show headings with certain to-do keywords by typing the keyword, e.g. TODO or DONE.
- Multiple to-do keywords are matched with boolean OR.
- Show headings with certain priorities by typing, e.g. #A or [#A].
- Show headings with certain tags by searching for, e.g. :tag1:tag2:.
- Negate matches with a !, e.g. pepperoni !anchovies.
- Sort results by timestamp or buffer-order (the default) by calling commands with a universal prefix (C-u).
- Show entries in an indirect buffer by selecting that action from the Helm actions list, or by pressing <C-return>.
- The keymap for helm-org-rifle-occur results buffers imitates the org-speed keys, making it quicker to navigate. You can also collapse and expand headings and drawers with TAB and S-TAB, just like in regular Org buffers. Results buffers are marked read-only so you cannot modify them by accidental keypresses.
 - Delete the result at point in helm-org-rifle-occur buffers by pressing d. This does not alter the source buffers but simply removes uninteresting results from view.
- You can customize the helm-org-rifle group if you like.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package helm-org-rifle
  :ensure t
  :bind ("s-u" . helm-org-rifle))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23904 2416 473789 40000) :init (23904 2416 473492 686000) :init-secs (0 0 130 631000) :use-package-secs (0 0 667 779000)))

* Look at the Emacs or Elisp manual with helm

From: https://www.reddit.com/r/emacs/comments/cuc8hl/how_do_you_remember_various_features_of_emacs/


#+BEGIN_SRC emacs-lisp :tangle yes
(defun ap/helm-info-emacs-elisp-cl ()
  "Helm for Emacs, Elisp, and CL-library info pages."
  (interactive)
  (helm :sources '(helm-source-info-emacs
                   helm-source-info-elisp
                   helm-source-info-cl)))

(global-set-key (kbd "s-8") 'ap/helm-info-emacs-elisp-cl)
#+END_SRC

#+RESULTS:
: ap/helm-info-emacs-elisp-cl

* COMMENT Worf and hydra

=worf= needs =hydra=

#+BEGIN_SRC emacs-lisp :tangle no
(use-package hydra)
(use-package worf)
#+END_SRC

** COMMENT Worf costumization to work as a search engine across org headers

#+BEGIN_SRC emacs-lisp :tangle no
;; ——— WORF Utilities ———————————————————————————————————————————————————————————————
;; https://github.com/abo-abo/worf/blob/master/worf.el
(defun worf--pretty-heading (str lvl)
  "Prettify heading STR or level LVL."
  (setq str (or str ""))
  (setq str (propertize str 'face (nth (1- lvl) org-level-faces)))
  (let (desc)
    (while (and (string-match org-bracket-link-regexp str)
                (stringp (setq desc (match-string 3 str))))
      (setq str (replace-match
                 (propertize desc 'face 'org-link)
                 nil nil str)))
    str))
(defun worf--pattern-transformer (x)
  "Transform X to make 1-9 select the heading level in `worf-goto'."
  (if (string-match "^[1-9]" x)
      (setq x (format "^%s" x))
    x))

(defun worf-goto ()
  "Jump to a heading with `helm'."
  (interactive)
  (require 'helm-match-plugin) ;; commented out by DGM as I think it is not needed. See https://stackoverflow.com/questions/19098272/initialization-error-caused-by-helm-match-plugin
  (let ((candidates
         (org-map-entries
          (lambda ()
            (let ((comp (org-heading-components))
                  (h (org-get-heading)))
              (cons (format "%d%s%s" (car comp)
                            (make-string (1+ (* 2 (1- (car comp)))) ?\ )
                            (if (get-text-property 0 'fontified h)
                                h
                              (worf--pretty-heading (nth 4 comp) (car comp))))
                    (point))))))
        helm-update-blacklist-regexps
        helm-candidate-number-limit)
    (helm :sources
          `((name . "Headings")
            (candidates . ,candidates)
            (action . (lambda (x) (goto-char x)
                        (call-interactively 'show-branches)
                        (worf-more)))
            (pattern-transformer . worf--pattern-transformer)))))

(global-set-key (kbd "C-=") 'worf-goto)
#+END_SRC

#+RESULTS:
: worf-goto

* Org in buffer heading search

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "s-p") 'helm-org-in-buffer-headings)
#+END_SRC

#+RESULTS:
: helm-org-in-buffer-headings

* Helm-color
#+begin_src emacs-lisp :tangle yes
(global-set-key (kbd "s-c") 'helm-colors) 
#+end_src

#+RESULTS:
: helm-colors

* Provide

#+BEGIN_SRC emacs-lisp :tangle yes
(provide 'starter-kit-helm)
#+END_SRC

#+RESULTS:
: starter-kit-helm

* Final message
#+source: message-line
#+begin_src emacs-lisp :tangle yes
(message "Starter Kit Helm File loaded.")
#+end_src

#+RESULTS: message-line
: Starter Kit User File loaded.

.
